**经过数据评估并清洗后的数据才是我们分析的对象，数据评估从内容和结构两方面**

# 评估数据的结构

乱数据-结构方面需要清理的数据<br>
整洁数据-结构方面不需要清理的数据，判断标准如下：<br>
1. 每列是一个变量，变量”就是你要记录的“信息的类别，若列名为：销售额_2024那么这列就不是一个变量，它包含年份+销售额两类信息！是乱数据
2. 每行是一个观察值，观察值”就是你要记录的一个具体的对象，每一行，就代表一个具体的数据实例如人或物。如记录居民信息的表中它结构显示一行有多个居民名字那么就是乱数据
3. 每个单元格是一个值，值”就是“该属性下的具体的信息内容如当一个单元格值为：2024/3562万元 那么就乱数据

*数据的整洁度就好比一个书架而数据的干净度就好比书本每页有无油污与破损所以整洁度一眼就可以看出而干净度要费点事*

In [2]:
import pandas as pd

In [6]:
df1 = pd.read_csv(r"F:\BaiduNetdiskDownload\数据分析课程操作的文件\03数据获取与读取篇\personal_data.csv")
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22 entries, 0 to 21
Data columns (total 8 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              22 non-null     int64
 1   Gender                  22 non-null     object
 2   Age                     22 non-null     int64
 3   Annual Income ($)       22 non-null     int64
 4   Spending Score (1-100)  22 non-null     int64
 5   Profession              22 non-null     object
 6   Work Experience         22 non-null     int64
 7   Family Size             22 non-null     int64
dtypes: int64(6), object(2)
memory usage: 1.5+ KB

**评估数据的整洁度可以通过info()方法查看数据集的概况信息，可通过属性名：若为2022-价格这种命名方式就可以断定为乱数据了
<br>再通过head()tail()sample()方法对结构进行具体评估，sample()方法是随机查看**

In [7]:
df1.head(2)

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
0,1,Male,19,15000,39,"Healthcare,Social Work",1,4
1,2,Male,21,35000,81,Engineer,3,3

In [8]:
df1.tail(3)

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
19,20,Female,35,62000,98,Artist,0,1
20,21,Male,35,96000,35,Homemaker,12,1
21,22,Male,25,4000,73,Healthcare,3,4

In [9]:
df1.sample(5)

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
9,10,Female,30,98000,72,Artist,1,4
5,6,Female,22,58000,76,Artist,0,2
2,3,Female,20,86000,6,Engineer,1,1
20,21,Male,35,96000,35,Homemaker,12,1
16,17,Female,35,29000,35,Homemaker,9,5

In [10]:
df1.sample(4)

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
11,12,Female,35,93000,99,Healthcare,4,4
15,16,Male,22,51000,79,Healthcare,1,2
6,7,Female,35,31000,6,Healthcare,1,3
14,15,Male,37,19000,13,Doctor,0,1

# 评估数据的内容

脏数据-内容方面需要清理的数据<br>
干净数据-内容方面不需要清理的数据
脏数据类型如下：
1. 丢失数据-nan，会让平均值变小
2. 重复数据-学号重复了碍事，性别重复正常
3. 不一致数据：小明对应班级为1班，小红与小明同班但是班级为一班，1与一让数据不一致
4. 无效或错误数据：无效-负数的身高，错误-成年人体重1公斤

*若读取的数据集体量大且存在值的字符串过多情况记得事先set_option一下！*

In [13]:
pd.set_option("display.max_columns",1000000)

In [14]:
pd.set_option("display.max_colwidth",10000000000)

## 评估丢失数据的方法

### 法一.info()可以告诉每列下非空缺值数量，与总行数对比即可

In [15]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22 entries, 0 to 21
Data columns (total 8 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              22 non-null     int64
 1   Gender                  22 non-null     object
 2   Age                     22 non-null     int64
 3   Annual Income ($)       22 non-null     int64
 4   Spending Score (1-100)  22 non-null     int64
 5   Profession              22 non-null     object
 6   Work Experience         22 non-null     int64
 7   Family Size             22 non-null     int64
dtypes: int64(6), object(2)
memory usage: 1.5+ KB

### 法二.isnull()方法即可对Series也可对DataFrame判断空缺值个数

In [23]:
import numpy as np
scores = pd.DataFrame({
    "001": {"姓名": "小陈", "考试1": 85, "考试2": 95, "考试3": 92},  
    "002": {"姓名": "小李", "考试1": 91, "考试2": 92, "考试3": 94},  
    "003": {"姓名": "小王", "考试1": 86, "考试2": 81, "考试3": np.nan},  
    "004": {"姓名": "小张", "考试1": 79, "考试2": 89, "考试3": 95},  
    "005": {"姓名": "小赵", "考试1": 96, "考试2": 91, "考试3": 91},  
    "006": {"姓名": "小周", "考试1": 81, "考试2": np.nan, "考试3": 92} }).T
scores

     姓名 考试1  考试2  考试3
001  小陈  85   95   92
002  小李  91   92   94
003  小王  86   81  NaN
004  小张  79   89   95
005  小赵  96   91   91
006  小周  81  NaN   92

*以Series为例（df的每一个列就是Series）*

In [25]:
print(scores["考试2"])
scores["考试2"].isnull()

001     95
002     92
003     81
004     89
005     91
006    NaN
Name: 考试2, dtype: object

001    False
002    False
003    False
004    False
005    False
006     True
Name: 考试2, dtype: bool

**注意python中的True/False被用于数学计算中会被当做1/0,所以你对series调用sum（默认axis=0）的时候就会把所有出现True求和，结果就是空缺值个数同理df由列由各个Series组成对df用isnull后再sum就是计算每列的空缺值个数**

In [26]:
True-1 == False

True

In [35]:
scores["考试2"].isnull().sum()

np.int64(1)

In [36]:
print(scores.isnull())
scores.isnull().sum()

        姓名    考试1    考试2    考试3
001  False  False  False  False
002  False  False  False  False
003  False  False  False   True
004  False  False  False  False
005  False  False  False  False
006  False  False   True  False

姓名     0
考试1    0
考试2    1
考试3    1
dtype: int64

In [37]:
scores.isnull().sum(axis=1)

001    0
002    0
003    1
004    0
005    0
006    1
dtype: int64

*对于df-提取df某属性存在空缺值的行*

In [49]:
scores

     姓名 考试1  考试2  考试3
001  小陈  85   95   92
002  小李  91   92   94
003  小王  86   81  NaN
004  小张  79   89   95
005  小赵  96   91   91
006  小周  81  NaN   92

In [39]:
scores[scores["考试3"].isnull()]

     姓名 考试1 考试2  考试3
003  小王  86  81  NaN

## 评估数据重复-duplicated

In [50]:
name = pd.Series(["小陈", "小李", "小王", "小张", "小赵", "小李", "小周"])
gender = pd.Series(["女", "女", "男", "男", "女", "女", "女"])
height = pd.Series([172.5, 168.0, 178.2, 181.3, 161.7, 168.0, 158.5])
student_number = pd.Series(["001", "002", "003", "002", "005", "002", "006"])
students = pd.DataFrame({"学号": student_number, "姓名": name, "性别": gender, "身高": height})
students

    学号  姓名 性别     身高
0  001  小陈  女  172.5
1  002  小李  女  168.0
2  003  小王  男  178.2
3  002  小张  男  181.3
4  005  小赵  女  161.7
5  002  小李  女  168.0
6  006  小周  女  158.5

In [52]:
print(students["学号"])
students["学号"].duplicated()

0    001
1    002
2    003
3    002
4    005
5    002
6    006
Name: 学号, dtype: object

0    False
1    False
2    False
3     True
4    False
5     True
6    False
Name: 学号, dtype: bool

*对Series调用duplicated时候当该值与前面出现过的值重复时候被设为True<br>对df用duplicated时候仅当前行中所有值与前面所出现的行的所有值一样的时候才会设置该行为True*

In [53]:
students.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
dtype: bool

**duplicated默认该行所有值与之前所出现过的一样时候才会设True,也可以通过设置可选参数subset[]列表指定该行哪些属性与之前行一致即可设置为True**

In [55]:
students.duplicated(subset=["姓名","身高"])

0    False
1    False
2    False
3    False
4    False
5     True
6    False
dtype: bool

In [56]:
students.duplicated(subset=["性别"])

0    False
1     True
2    False
3     True
4     True
5     True
6     True
dtype: bool

**提取重复数据的行**

In [57]:
students[students.duplicated(subset=["性别"])]

    学号  姓名 性别     身高
1  002  小李  女  168.0
3  002  小张  男  181.3
4  005  小赵  女  161.7
5  002  小李  女  168.0
6  006  小周  女  158.5

## 评估不一致数据

In [59]:
name = pd.Series(["小陈", "小李", "小李", "小王", "小张", "小赵", "小周"])
gender = pd.Series(["女", "woman", "女", "m", "M", "男", "fe"])
class_number = pd.Series(["1 班", "①班", "1 班", "一班", "二班", "2 班", "2 班"])
student_number = pd.Series(["001", "002", "002", "003", "004", "005", "006"])
students = pd.DataFrame({"学号": student_number, "姓名": name, "性别": gender, "班级": class_number})
students

    学号  姓名     性别   班级
0  001  小陈      女  1 班
1  002  小李  woman   ①班
2  002  小李      女  1 班
3  003  小王      m   一班
4  004  小张      M   二班
5  005  小赵      男  2 班
6  006  小周     fe  2 班

**通过value_counts()来查看该属性列下值的种类与该种类值出现的个数来统计不一致数据**

In [60]:
students["性别"].value_counts()

性别
女        2
woman    1
m        1
M        1
男        1
fe       1
Name: count, dtype: int64

## 评估无效/错误数据

In [62]:
name = pd.Series(["小陈", "小李", "小李", "小王", "小张", "小赵", "小周"])
gender = pd.Series(["女", "女", "女", "男", "男", "女", "女"])
height = pd.Series([172.5, 168.0, 1168.0, 178.2, 181.3, -161.7, 158.5])
students = pd.DataFrame({"姓名": name, "性别": gender, "身高": height})
students

   姓名 性别      身高
0  小陈  女   172.5
1  小李  女   168.0
2  小李  女  1168.0
3  小王  男   178.2
4  小张  男   181.3
5  小赵  女  -161.7
6  小周  女   158.5

In [63]:
students.describe()

                身高
count     7.000000
mean    266.400000
std     416.596447
min    -161.700000
25%     163.250000
50%     172.500000
75%     179.750000
max    1168.000000

In [64]:
students["身高"].sort_values()

5    -161.7
6     158.5
1     168.0
0     172.5
3     178.2
4     181.3
2    1168.0
Name: 身高, dtype: float64

**数据的评估很难评估到方方面面又或是评估的很精确，评估的目的在于确定清洗方法，有泥水冲，有虫摘虫**

**数据评估完后就是对评估的结果决定清洗操作**